{
    "course_name": "Semantic Intelligent Information Access (SIIA)",
    "description": "This course focuses on semantics and content representation, exploring foundational concepts, advanced techniques, and practical applications. Students will learn to analyze both implicit (endogenous) and explicit (exogenous) semantics, leveraging structured knowledge sources and linking content to knowledge graphs. Additionally, the course delves into semantics-aware systems for intelligent information access, including recommendation systems, social media analysis, and advanced challenges like deep learning, explainability, conversational systems, and serendipity. The program combines theoretical lessons with hands-on classroom exercises to provide a comprehensive understanding of semantic technologies and their applications.",
    "keywords": [
        "semantic search",
        "knowledge graphs",
        "information retrieval",
        "NLP",
        "recommendation systems",
        "Exogenous semantics",
        "Endogenous semantics"
    ],
    "instructor": [
        "Prof. Giovanni Semeraro",
        "Prof. Cataldo Musto"
    ],
    "last_updated": "2024-12-22",
    "syllabus": "syllabuses/SIIA_syllabus.pdf",
    "books": [
        {
            "title": "Semantics in Adaptive and Personalized Systems",
            "filename": "books/Book_on_Semantics_in_Adaptive_And_Personalized_Systems.pdf",
            "description": "The book first introduces the problem of information overload and the reasons why content-based information needs to be taken into account. Next, the basics of Natural Language Processing are provided, by describing operations such as tokenization, stopword removal, lemmatization, stemming, part-of-speech tagging, along with the main problems and issues. Finally, the book describes the different approaches for semantics-aware content representation: such approaches are split into ‘exogenous’ and ‘endogenous’ ones, depending on whether external knowledge sources as DBpedia or geometrical models and distributional semantics are used, respectively. To conclude, several successful use cases and an extensive list of available tools and resources to implement the approaches are shown.",
            "author": "Pasquale Lops, Cataldo Musto, Fedelucio Narducci, Giovanni Semeraro",
            "publisher": "Springer Cham",
            "year": 2019,
            "isbn": "9783030056179"
        }
    ],
    "lessons": [
        {
            "lesson_number": 1,
            "metadata": "lesson1_metadata.json"
        },
        {
            "lesson_number": 2,
            "metadata": "lesson2_metadata.json"
        },
        {
            "lesson_number": 3,
            "metadata": "lesson3_metadata.json"
        },
        {
            "lesson_number": 4,
            "metadata": "lesson4_metadata.json"
        },
        {
            "lesson_number": 5,
            "metadata": "lesson5_metadata.json"
        },
        {
            "lesson_number": 6,
            "metadata": "lesson6_metadata.json"
        },
        {
            "lesson_number": 7,
            "metadata": "lesson7_metadata.json"
        },
        {
            "lesson_number": 8,
            "metadata": "lesson8_metadata.json"
        },
        {
            "lesson_number": 9,
            "metadata": "lesson9_metadata.json"
        },
        {
            "lesson_number": 10,
            "metadata": "lesson10_metadata.json"
        },
        {
            "lesson_number": 11,
            "metadata": "lesson11_metadata.json"
        },
        {
            "lesson_number": 12,
            "metadata": "lesson12_metadata.json"
        }
    ]
}